{
  "users": [
    {
      "id": "user001",
      "email": "alex@example.com",
      "username": "AlexRay",
      "createdAt": "2023-10-26T10:00:00Z"
    },
    {
      "id": "user002",
      "email": "brianna@example.com",
      "username": "BriannaC",
      "createdAt": "2023-10-28T11:20:00Z"
    },
    {
      "id": "user003",
      "email": "charlie@example.com",
      "username": "CharlieDay",
      "createdAt": "2023-11-01T15:00:00Z"
    }
  ],
  "discussionPosts": [
    {
      "id": "post001", "userId": "user001", "username": "AlexRay", "category": "diagnosis-newly-diagnosed",
      "title": "Just got my diagnosis, feeling a bit overwhelmed.",
      "content": "Hi everyone, I'm new here. Just received my Chiari diagnosis and feeling a mix of relief to have an answer and fear of the unknown. How did you all cope when you were first diagnosed? Any advice on finding a good specialist?",
      "createdAt": "2023-11-02T14:30:00Z"
    },
    {
      "id": "post002", "userId": "user002", "username": "BriannaC", "category": "symptom-management",
      "title": "Managing headaches and neck pain - what works for you?",
      "content": "The constant headaches are the worst part for me. I've tried medication, but I'm looking for non-pharmacological ways to manage the pain. Has anyone had success with physical therapy, specific pillows, or other lifestyle changes? Would love to hear your experiences.",
      "createdAt": "2023-11-03T09:00:00Z"
    },
    {
      "id": "post003", "userId": "user003", "username": "CharlieDay", "category": "surgery-recovery",
      "title": "Post-Decompression Surgery - Recovery Tips?",
      "content": "I'm 2 weeks post-op from my decompression surgery. The immediate relief from some symptoms is amazing, but the recovery is definitely a journey. For those who've been through it, what did your recovery timeline look like? Any tips for dealing with fatigue and incision site discomfort?",
      "createdAt": "2023-11-05T18:00:00Z"
    },
    {
      "id": "post004", "userId": "user001", "username": "AlexRay", "category": "daily-life-work",
      "title": "Brain fog is seriously impacting my work.",
      "content": "I'm a software developer and the brain fog has been making it so hard to concentrate and solve complex problems. It feels like my brain is wading through mud. How do you explain this to your employer? Any strategies for staying sharp and productive?",
      "createdAt": "2023-11-06T11:45:00Z"
    },
    {
      "id": "post005", "userId": "user002", "username": "BriannaC", "category": "symptom-management",
      "title": "Success story! Finding a pillow that actually helps!",
      "content": "Just wanted to share a small win. After trying about 5 different pillows, I finally found a cervical pillow that has made a noticeable difference in my morning neck pain and headaches. It's not a cure-all, but it's a huge improvement. Don't give up on finding the small things that can help!",
      "createdAt": "2023-11-07T20:15:00Z"
    },
    {
        "id": "post006", "userId": "user003", "username": "CharlieDay", "category": "mental-health-wellness",
        "title": "Dealing with the anxiety of it all",
        "content": "Some days the anxiety about the future is worse than the physical symptoms. How do you all manage the mental and emotional side of living with a chronic condition? I'm trying meditation but my mind races.",
        "createdAt": "2023-11-08T10:00:00Z"
    },
    {
        "id": "post007", "userId": "user001", "username": "AlexRay", "category": "treatments-therapies",
        "title": "Has anyone tried vestibular therapy?",
        "content": "My neurologist recommended vestibular therapy for my balance issues and dizziness. I'm starting next week. Has anyone been through it? Did it help? Curious to know what to expect.",
        "createdAt": "2023-11-09T16:20:00Z"
    },
    {
        "id": "post008", "userId": "user002", "username": "BriannaC", "category": "family-relationships",
        "title": "Explaining 'invisible illness' to family",
        "content": "It's so hard explaining to my family why I have to cancel plans sometimes. On the outside I look fine, but on the inside I'm struggling. How do you get your loved ones to understand what you're going through?",
        "createdAt": "2023-11-10T12:00:00Z"
    },
    {
        "id": "post009", "userId": "user003", "username": "CharlieDay", "category": "research-news",
        "title": "Interesting new paper on CSF flow",
        "content": "Came across a new research paper about CSF flow dynamics in Chiari patients. It's a bit technical, but it's exciting to see active research happening. Anyone else follow the latest studies?",
        "createdAt": "2023-11-11T08:45:00Z"
    },
    {
        "id": "post010", "userId": "user001", "username": "AlexRay", "category": "surgery-recovery",
        "title": "Considering surgery but terrified",
        "content": "My doctor brought up the possibility of decompression surgery. The thought of it is terrifying. For those who decided to have the surgery, what was the final straw that made you decide it was the right choice?",
        "createdAt": "2023-11-12T19:00:00Z"
    },
    {
        "id": "post011", "userId": "user002", "username": "BriannaC", "category": "diagnosis-newly-diagnosed",
        "title": "What were your first symptoms?",
        "content": "Looking back, I think I had symptoms for years before I was diagnosed. Mine started with just a weird pressure in the back of my head. What was the first sign for everyone else?",
        "createdAt": "2023-11-13T11:10:00Z"
    },
    {
        "id": "post012", "userId": "user003", "username": "CharlieDay", "category": "daily-life-work",
        "title": "Accommodations at work that have helped me",
        "content": "Just wanted to share some accommodations that have made a huge difference for me at my office job: a proper ergonomic chair, an adjustable standing desk, and permission to take short breaks to lie down when the pressure gets bad. Don't be afraid to ask for what you need.",
        "createdAt": "2023-11-14T09:30:00Z"
    },
    {
        "id": "post013", "userId": "user001", "username": "AlexRay", "category": "symptom-management",
        "title": "Does weather affect your symptoms?",
        "content": "I swear my symptoms get ten times worse when a storm is rolling in. The change in barometric pressure just wrecks me. Is this a common thing?",
        "createdAt": "2023-11-15T13:00:00Z"
    },
    {
        "id": "post014", "userId": "user002", "username": "BriannaC", "category": "mental-health-wellness",
        "title": "Finding a therapist who understands chronic illness",
        "content": "It took me a while, but I finally found a therapist who specializes in counseling for people with chronic illnesses. It's been a game-changer to talk to someone who 'gets it'. Highly recommend it if you're struggling with the mental load.",
        "createdAt": "2023-11-16T15:25:00Z"
    },
    {
        "id": "post015", "userId": "user003", "username": "CharlieDay", "category": "treatments-therapies",
        "title": "Acupuncture for pain relief?",
        "content": "My physical therapist suggested I try acupuncture for my chronic neck and shoulder pain. I'm a little skeptical but willing to try anything at this point. Has anyone found it helpful?",
        "createdAt": "2023-11-17T10:50:00Z"
    },
    {
        "id": "post016", "userId": "user001", "username": "AlexRay", "category": "family-relationships",
        "title": "Parenting with Chiari",
        "content": "Being a parent to young kids while dealing with Chiari symptoms is a whole new level of exhaustion. Some days I feel so guilty that I can't be the energetic parent I want to be. Any other Chiari parents out there with advice or just solidarity?",
        "createdAt": "2023-11-18T12:15:00Z"
    },
    {
        "id": "post017", "userId": "user002", "username": "BriannaC", "category": "research-news",
        "title": "Annual Chiari & Syringomyelia Conference notes",
        "content": "Just watched the recordings from the latest virtual conference. Some really promising discussions on genetic links and new imaging techniques. It gives me hope for the future of treatment.",
        "createdAt": "2023-11-19T21:00:00Z"
    },
    {
        "id": "post018", "userId": "user003", "username": "CharlieDay", "category": "diagnosis-newly-diagnosed",
        "title": "The relief of a diagnosis",
        "content": "After years of being told it was 'just migraines' or 'anxiety', finally seeing the Chiari on the MRI and having a name for my suffering was so validating. It's a tough road, but at least now I know I'm not crazy.",
        "createdAt": "2023-11-20T09:00:00Z"
    },
    {
        "id": "post019", "userId": "user001", "username": "AlexRay", "category": "daily-life-work",
        "title": "Tips for traveling with Chiari",
        "content": "I have to travel for work next month and I'm a bit nervous. Long flights and uncomfortable hotel beds are not my friend. Any tips for making travel more manageable?",
        "createdAt": "2023-11-21T14:55:00Z"
    },
    {
        "id": "post020", "userId": "user002", "username": "BriannaC", "category": "surgery-recovery",
        "title": "One year post-op reflection",
        "content": "It's officially been one year since my decompression surgery. It wasn't a magic cure, and I still have bad days, but the difference is night and day. The debilitating pressure headaches are gone. To anyone considering it, it's a tough choice, but for me, it was worth it.",
        "createdAt": "2023-11-22T17:30:00Z"
    },
    {
      "id": "post021", "userId": "user003", "username": "CharlieDay", "category": "symptom-management",
      "title": "Tinnitus and ear pressure",
      "content": "Does anyone else deal with constant ringing in their ears (tinnitus) or a feeling of fullness/pressure? It's one of my most persistent symptoms. It's not painful, just incredibly annoying. Any tips for coping?",
      "createdAt": "2023-11-23T10:00:00Z"
    },
    {
      "id": "post022", "userId": "user001", "username": "AlexRay", "category": "treatments-therapies",
      "title": "Opinions on Gabapentin?",
      "content": "My doctor prescribed Gabapentin for nerve pain. I'm always hesitant to start a new daily medication. What are people's experiences with it, both good and bad?",
      "createdAt": "2023-11-23T18:20:00Z"
    },
    {
      "id": "post023", "userId": "user002", "username": "BriannaC", "category": "mental-health-wellness",
      "title": "Acceptance is a process",
      "content": "Just a thought for today. I'm learning that accepting this diagnosis isn't a one-time event. Some days I'm at peace with it, and other days I'm grieving the life I thought I'd have. It's a constant process of acceptance and re-acceptance. Be kind to yourselves.",
      "createdAt": "2023-11-24T11:00:00Z"
    },
    {
      "id": "post024", "userId": "user003", "username": "CharlieDay", "category": "family-relationships",
      "title": "My partner is my rock",
      "content": "Just a shout-out to my amazing husband. He's been so patient and understanding, even when I have to cancel plans at the last minute or can't do things around the house. Having a supportive partner makes such a huge difference.",
      "createdAt": "2023-11-25T09:15:00Z"
    },
    {
      "id": "post025", "userId": "user001", "username": "AlexRay", "category": "research-news",
      "title": "Any new clinical trials on the horizon?",
      "content": "Does anyone keep track of upcoming clinical trials? I'm always interested to see what new treatments or therapies are being investigated. It feels empowering to stay informed.",
      "createdAt": "2023-11-26T14:00:00Z"
    },
    {
        "id": "post026", "userId": "user002", "username": "BriannaC", "category": "diagnosis-newly-diagnosed",
        "title": "What questions should I ask my neurosurgeon?",
        "content": "I have my first appointment with a neurosurgeon next week. I'm making a list of questions to ask. What are some important things you wish you had asked at your first consultation?",
        "createdAt": "2023-11-27T10:30:00Z"
    },
    {
        "id": "post027", "userId": "user003", "username": "CharlieDay", "category": "daily-life-work",
        "title": "The joy of a 'good' day",
        "content": "Woke up today with almost no headache and a clear head. It's a 'good' day! You really learn to appreciate these days so much more. Going to try and get some light exercise in without overdoing it. Hope everyone else is having a low-symptom day too.",
        "createdAt": "2023-11-28T08:00:00Z"
    },
    {
      "id": "post028", "userId": "user001", "username": "AlexRay", "category": "surgery-recovery",
      "title": "Strange nerve sensations post-op",
      "content": "I'm about 3 months post-op and I've been getting these weird tingling/crawling sensations on my scalp near the incision. My surgeon says it's normal as nerves heal, but it's such a strange feeling. Anyone else experience this?",
      "createdAt": "2023-11-29T16:45:00Z"
    },
    {
      "id": "post029", "userId": "user002", "username": "BriannaC", "category": "treatments-therapies",
      "title": "Massage Therapy - Does it help or hurt?",
      "content": "I'm thinking about getting a massage for my constant neck and shoulder tension, but I'm also worried it could make things worse. Has anyone had good or bad experiences with massage therapy?",
      "createdAt": "2023-11-30T11:20:00Z"
    },
    {
      "id": "post030", "userId": "user003", "username": "CharlieDay", "category": "symptom-management",
      "title": "Dealing with Dysphagia (trouble swallowing)",
      "content": "My swallowing issues have been getting more frequent lately. It's scary when it feels like food is stuck. My doctor recommended a modified barium swallow study. Has anyone found specific food consistencies or techniques that help?",
      "createdAt": "2023-12-01T15:00:00Z"
    },
    {
      "id": "post031", "userId": "user001", "username": "AlexRay", "category": "mental-health-wellness",
      "title": "The frustration of fluctuating symptoms",
      "content": "One of the hardest parts for me is how my symptoms can change so much day-to-day. I'll have a few good days and start to feel hopeful, then a bad day hits and it's so discouraging. It's an emotional rollercoaster.",
      "createdAt": "2023-12-02T10:10:00Z"
    },
    {
      "id": "post032", "userId": "user002", "username": "BriannaC", "category": "daily-life-work",
      "title": "Finding a Chiari-aware primary care doctor",
      "content": "I feel like my primary care doctor doesn't really understand Chiari and just refers everything to my neurologist. Has anyone had luck finding a PCP who is knowledgeable about Chiari for managing general health stuff?",
      "createdAt": "2023-12-03T13:40:00Z"
    },
    {
      "id": "post033", "userId": "user003", "username": "CharlieDay", "category": "family-relationships",
      "title": "How to handle friends who don't get it",
      "content": "I have a friend who keeps saying things like, 'You just need to push through it' or 'Have you tried yoga?'. I know they mean well, but it's so dismissive. I'm running out of patience. How do you handle this without ruining friendships?",
      "createdAt": "2023-12-04T09:00:00Z"
    },
    {
      "id": "post034", "userId": "user001", "username": "AlexRay", "category": "research-news",
      "title": "Connective tissue disorders and Chiari link?",
      "content": "I've been reading a lot about the correlation between Chiari and connective tissue disorders like Ehlers-Danlos Syndrome (EDS). My doctor is testing me for it now. Anyone else here have a dual diagnosis?",
      "createdAt": "2023-12-05T18:00:00Z"
    },
    {
      "id": "post035", "userId": "user002", "username": "BriannaC", "category": "diagnosis-newly-diagnosed",
      "title": "Finding out I have a syrinx",
      "content": "My latest MRI showed that I've developed a syrinx in my cervical spine. It adds a whole new layer of worry. For those with syringomyelia, what did your treatment path look like after it was found?",
      "createdAt": "2023-12-06T11:55:00Z"
    }
  ]
}